Revit 2027 API
StructuralSettings.GetLoadForceVectorReprLine Method
 Returns the representative line of the load force vector according to loads display scaling.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetLoadForceVectorReprLine(
	LoadType loadType,
	XYZ forceVector
)
Public Function GetLoadForceVectorReprLine (
	loadType As LoadType,
	forceVector As XYZ
) As XYZ
public:
XYZ^ GetLoadForceVectorReprLine(
	LoadType loadType,
	XYZ^ forceVector
)
member GetLoadForceVectorReprLine :
        loadType : LoadType *
        forceVector : XYZ -> XYZ
Parameters
loadType LoadType
 LoadType::Point, Line, or Area
forceVector XYZ
 The load force vector in internal units.
Return Value
XYZ
 The the representative line in internal units.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace